[
    {
        "title": "Sept'21 - Jun'24",
        "cardTitle": "Dublin, Ireland",
        "media": {
            "name": "Trinity College Dublin, Ireland",
            "source": {
                "url": "https://www.tcd.ie/identity/assets/logos/Logos%20page/png/Trinity%20logo%20%E2%80%93%20White.png"
            },
            "type": "IMAGE"
        },
        "items": [
            {
                "cardTitle": "M.A.I. in Computer Engineering",
                "cardSubtitle": "Sept'23 - Jun'24",
                "cardDetailedText": [
                    "Relevant Coursework: Information Retrieval and Search Optimisation, Adaptive Applications, Software Engineering",
                    "Completed my research project on Gesture Recognition based Smart Device control using Google's Mediapipe and an LSTM Neural Network",
                    "Secured a spot among the top 10 graduates from the Gradireland's Graduate of the Year 2023-24 event."
                ]
            },
            {
                "cardTitle": "B.A.I. in Computer Engineering",
                "cardSubtitle": "Sept'21 - Aug'23",
                "cardDetailedText": [
                    "Relevant Coursework: Computer Networks, Internet Applications, Database Management Systems, Project Management, Deep Learning, Microprocessor Systems, Probability and Statistics",
                    "Completed of an 8-month software engineering internship at General Motors, Dublin, Ireland.",
                    "Secured a 15% scholarship for my future Masters' degree at Trinity."
                ]
            }
        ]
    },
    {
        "title": "Aug'19 - Aug'23",
        "cardTitle": "Patiala, Punjab, India",
        "cardSubtitle": "B.Tech in Computer Engineering",
        "media": {
            "name": "Thapar Institute of Engineering and Technology, Patiala, Punjab, India",
            "source": {
                "url": "https://d2lk14jtvqry1q.cloudfront.net/media/small_Thapar_Institute_of_Engineering_and_Technology_Thapar_University_06036259ee_6f106c6e8b_15190eeeb2_65b1d7ffa3.png"
            },
            "type": "IMAGE"
        },
        "cardDetailedText": [
            "Relevant Coursework: Data Structures and Algorithms, Machine Learning, Artificial Intelligence, Discrete Mathematical Structures, Engineering Design Project",
            "Identified as the top 1% of the students who were given a chance to be a part of the International Engineering Program (IEP) to complete their last two years of the Bachelor's degree in Trinity College Dublin",
            "Awarded the title of Game of Codes 2019 Champion, an event organised by the OWASP Thapar community which saw 200+ developers competing for the top rank."
        ]
    },
    {
        "title": " - Jun'19",
        "cardTitle": "Kanpur, UP, India",
        "cardSubtitle": "Higher Secondary Education",
        "media": {
            "name": "Sheiling House School, Kanpur, UP, India",
            "source": {
                "url": "https://seniorwing.shskanpur.com/images/Sheiling-House-Logo-2.png"
            },
            "type": "IMAGE"
        },
        "cardDetailedText": [
            "Relevant Coursework: Computer Science, Object Oriented Programming with Java",
            "Achieved a spot among the top 6% students nationwide for the Joint Entrance Exam (JEE) Mains given by more than 11 lakh students in India.",
            "Senior mentor in the Sheiling House Computer Club. Spearhead for various events for the annual Teknovation fest for two consecutive years."
        ]
    }
]