[
    "My interest in computers began in the 8th grade when I was introduced to Java as part of my academic curriculum. Captivated by the endless possibilities of programming, I resolved to turn this passion into a lifelong career.",
    "My first software project was a Java-based command-line chatbot named Asterix. It operated as a rule-based bot, tokenizing user prompts and matching keywords to its predefined capabilities. Asterix could handle basic interactions like responding to greetings and offered simple terminal-based games, including Tic-Tac-Toe, Hand Cricket, and Rock-Paper-Scissors. While I initially planned to integrate the Google Search API for handling prompts outside its rule set, time constraints prevented me from implementing that feature.",
    "While it took me about 3-4 months to complete my first portfolio website using only HTML and CSS, it took me only about 3 weeks to complete the second iteration using React and JavaScript.",
    "I was the first one in my family to work in the sofware industry.",
    "I love to play Badminton, Table Tennis, Foosball and Pool.",
    "I own the fact that I have been a huge Marvel nerd way before it got popular due to Infinity War and Endgame. I believe that I know about the MCU way more than most of the people I have ever met. Quote me on that in our next conversation.",
    "I am highly organised when it comes to my workspace and digital resources. While occasionally I misplace my keys, I know exactly where every file is, even from 6 years ago.",
    "I still maintain all of my previous projects, keeping them up-to-date while also adding new features or improvements occasionally.",
    "In my opinion, The Arkham games still have one of the best Batman storylines ever implemented in a live action media.",
    "I love to draw but hate to paint or color.",
    "I love to collect quotes that blow my mind and have an inspirational effect on me. I also try to write my own quotes.",
    "I used to beatbox back in high school.",
    "I plan to one day learn how to play the guitar.",
    "I dream to one day design my own mobile operating system with special focus on user experience.",
    "I am a very huge fan of First Person shooter games. Try and challenge me at a Call of Duty game.",
    "My dream is to one day work in gaming industry."
]